class ThingType:
    """Типы предметов"""

    def __init__(self, name, all_full_names):
        self.name = name
        self.all_full_names = all_full_names

    ring = "Кольцо", (
        "Кольцо всевластья",
        "Золотое кольцо",
        "Серебренное кольцо",
    )
    pants = "Штаны", (
        "Хлопковые штаны",
        "Кожаные штаны",
        "Железные штаны",
        "Пояс верности",
    )
    jacket = "Куртка", (
        "Хлопковая куртка",
        "Кожаная куртка",
        "Железная куртка",
        "Золотая кираса",
    )
    hat = "Шапка", (
        "Вязаная шапочка",
        "Красная шапочка",
        "Кожаная шапочка",
        "Хлопковая шапка",
        "Железная шапка",
    )
    shoes = "Обувь", (
        "Сапоги скороходы",
        "Домашние тапочки",
        "Кожаные ботинки",
        "Железные ботинки",
    )
    gloves = "Перчатки", (
        "Кружевные  перчатки",
        "Кожанные перчатки",
        "Железные перчатки",
        "Титановые варежки",
    )
    weapon = "Оружие", (
        "Меч кладенец",
        "Железные меч",
        "Деревянный меч",
        "Каменный меч",
        "Железное копье",
    )

    all = (ring, pants, jacket, hat, shoes, gloves, weapon)

    def __str__(self):
        return self.name
